{"scenario":{"name":"SUBSTITUTE","filename-base":"def-substitute","version":"2016-02-16T01:17:47","steps":[{"step":1,"step-formula":"1","interface":"Acting -> Actuator","description":"Overwrite data","action":"SUBSTITUTE","target":"cybox:File","target-specifier":"cybox:FileObjectType","actuator":"endpoint","actuator-specifier":"(optional)","modifier":"options","notes":"<sample/>"},{"step":2,"step-formula":"=A2+1","interface":"Acting -> Actuator","description":"Substitute traffic","action":"SUBSTITUTE","target":"cybox:Network_Connection","target-specifier":"cybox:NetworkConnectionObjectType","actuator":"network.router","actuator-specifier":"(optional)","modifier":"options","notes":"<sample/>"}],"action":[{"name":"SCAN","description":"The SCAN action is the systematic examination of some aspect of the entity or its environment in order to obtain information.","specifier":"This action can be used to command the characterization of an environment (e.g., perform network, port, or vulnerability scanning) or to look for a specific occurrence of an object (e.g., file, IP, process). SCAN commands are distinct from the QUERY in that SCAN implies an analytic while a QUERY implies a routine retrieval of data.","occurs":"Actions that Gather and Convey Information"},{"name":"LOCATE","description":"The LOCATE action is used to find an object either physically, logically, functionally, or by organization.  This action enables one to tell where in the system an event or trigger occurred.","specifier":"This action is used for example to enable one to tell where in the system an event or trigger occurred, confirm that an asset is appropriately deployed, or ascertain details regarding a rogue device.","occurs":"Actions that Gather and Convey Information"},{"name":"QUERY","description":"The QUERY action initiates a single request for information.","specifier":"QUERY, like SCAN, is used to find out more information about the system or its environment.  In the case of QUERY, however, it is an isolated or specific information request, rather than a broadly scoped scan or on-going check.  QUERY tends to be a simple retrieval of a value for a specific parameter, while SCAN implies a more thorough examination and identification of anomalies (relative to a known good state).   The response to a query is typically (but not necessarily) conveyed within the command and control channel.","occurs":"Actions that Gather and Convey Information"},{"name":"REPORT","description":"The REPORT action tasks an entity to provide information to a designated recipient of the information.","specifier":"The REPORT action is used to request an actuator/sensor to provide certain information.  Along with the REPORT action and the type of information being requested, the recipient of the information must be specified in the command. The response to a REPORT action is typically (but not necessarily) conveyed outside of the command and control channel.","occurs":"Actions that Gather and Convey Information"},{"name":"GET","description":"The GET action tasks an entity to retrieve a specific object.","specifier":"The location of the object can be designated in the specifier of the TARGET.  The entity typically (but not necessarily) retrieves the object outside of the command and control channel.","occurs":"Actions that Gather and Convey Information"},{"name":"NOTIFY","description":"The NOTIFY action is used to direct an entity to send information to another entity.","specifier":"NOTIFY is distinct from REPORT in that NOTIFY is used for time sensitive event notification and carries a sense of persistence.","occurs":"Actions that Gather and Convey Information"},{"name":"DENY","description":"The DENY action is used to prevent a certain event or action from completion, such as preventing a flow from reaching a destination (e.g., block) or preventing access.","specifier":"The DENY action can be used to prevent a flow from reaching a destination (e.g., block) or prevent access.  DENY is a superset of current terms such as BLOCK (network perimeter devices) and DENY (user, access to system, access to files).","occurs":"Actions that Control Permissions"},{"name":"CONTAIN","description":"The CONTAIN action stipulates the isolation of a file or process or entity such that it cannot modify or access assets, processes or other  that support the business and/or operations of the enclave.  ","specifier":"The CONTAIN action is a superset of currently used terms such as ISOLATE, QUARANTINE or SANDBOX.  ","occurs":"Actions that Control Permissions"},{"name":"ALLOW","description":"The ALLOW action permits the access to or execution of something. ","specifier":"An ALLOW action is typically associated with something that was previously denied (e.g., block, quarantine).","occurs":"Actions that Control Permissions"},{"name":"START","description":"The START action initiates a process, application, system or some other activity.  ","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"STOP","description":"The STOP action halts a system or ends an activity.","specifier":"The STOP OpenC2 action is used to convey commonly used actions such as shutdown, kill, and terminate. The STOP action has nuances and options associated with it that are ACTUATOR specific.  In the case where more than one type of STOP action is applicable for a particular target and actuator, the default implementation of STOP will be a graceful shutdown. Action modifiers are used to indicate immediate or atypical STOP actions.","occurs":"Actions that Control Activities/Devices"},{"name":"RESTART","description":"The RESTART action conducts a STOP of a system or an activity followed by a START of a system or an activity.","specifier":"A RESTART implies a graceful shutdown, maintenance of state, and a new configuration.","occurs":"Actions that Control Activities/Devices"},{"name":"PAUSE","description":"The PAUSE action ceases a system or activity while maintaining state.","specifier":"A PAUSE remains in effect until a RESUME is issued, unless the PAUSE action is accompanied by modifier for a time-interval.","occurs":"Actions that Control Activities/Devices"},{"name":"RESUME","description":"The RESUME action starts a system or activity from a paused state.","specifier":"RESUME is only meaningful after a PAUSE command.","occurs":"Actions that Control Activities/Devices"},{"name":"SET","description":"The SET action changes a value, configuration, or state of a managed entity within an IT system.","specifier":"Typically this action is specified by a configuration item such as a sensor setting or privilege level and the command will have specifiers.  SET commands are intended for specific individual changes to the entity and the parameters are communicated in the C2 channel.","occurs":"Actions that Control Activities/Devices"},{"name":"UPDATE","description":"The UPDATE action instructs the component to retrieve and process a large or comprehensive software update, reconfiguration, or some other update.","specifier":"The settings, files, patches associated with an UPDATE action are typically retrieved out of band from the control channel.   UPDATE actions typically do not need to include details such as reboot or restart.  It is incumbent upon the OpenC2 compliant devices to include implementation details.  Modifiers such as ‘immediate’ and specifiers such as the path for the software may be added.","occurs":"Actions that Control Activities/Devices"},{"name":"MOVE","description":"The MOVE action changes the location of a file, subnet, network, or, process.","specifier":"MOVE is distinct from CONTAIN in that CONTAIN implies a desired effect of isolation and MOVE supports the more general case.","occurs":"Actions that Control Activities/Devices"},{"name":"REDIRECT","description":"The REDIRECT action changes the flow of traffic to a particular destination other than its original intended destination.","specifier":"The REDIRECT action includes the case of bypassing an intermediate point. REDIRECT is distinct from MOVE in that it encompasses the entire flow rather than a single instance, item or object.  MOVE supports the more atomic case.","occurs":"Actions that Control Activities/Devices"},{"name":"DELETE","description":"The DELETE action removes data and files.","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"SNAPSHOT","description":"The SNAPSHOT action records and stores the state of a target at an instant in time.","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"DETONATE","description":"The DETONATE action executes and observes the behavior of an object (e.g., file, hyperlink) in a manner that isolates the object from assets that support the business or operations of the enclave.","specifier":"DETONATE is distinct from CONTAIN in that DETONATE includes an execution and analytic component rather than just isolation.","occurs":"Actions that Control Activities/Devices"},{"name":"RESTORE","description":"The RESTORE action deletes and/or replaces files, settings, or attributes such that the state of the system is identical to its state at some previous time.","specifier":"The RESTORE could impact the whole system or return the state of an application or program to its previous state.  RESTORE can be used to undo a previous action.","occurs":"Actions that Control Activities/Devices"},{"name":"SAVE","description":"The SAVE action commits data or system state to memory.","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"MODIFY","description":"The MODIFY action augments, enhances, transforms, or changes some aspect of a system.","specifier":"MODIFY is used to change the attributes or behavior of some system element without stopping it or removing it from the system. MODIFY is a superset of commands such as set and rename.","occurs":"Actions that Control Activities/Devices"},{"name":"THROTTLE","description":"The THROTTLE action adjusts the throughput of entire data flow to a different  rate. ","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"DELAY","description":"The DELAY action stops or holds up an activity or data transmittal.","specifier":"The period of time for the delay can be specified in a modifier to the DELAY action.","occurs":"Actions that Control Activities/Devices"},{"name":"SUBSTITUTE","description":"The SUBSTITUTE action replaces all or part of the data, content or payload in the least detectable manner.","specifier":"SUBSTITUTE is used in cases where an attack is to be impeded or thwarted in an undetectable manner.","occurs":"Actions that Control Activities/Devices"},{"name":"COPY","description":"The COPY action duplicates a file or data flow.","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"SYNC","description":"The SYNC action synchronizes a sensor or actuator with other system components.","specifier":null,"occurs":"Actions that Control Activities/Devices"},{"name":"DISTILL","description":"The DISTILL action tasks the sensor to send a summary or abstraction of the sensing information instead of the raw data feed.","specifier":"The DISTILL action reduces the amount of sensor data.  The means of reduction or filtering is indicated by a specifier.","occurs":"Sensor-Related Actions"},{"name":"AUGMENT","description":"The AUGMENT action tasks the sensor to do a level of preprocessing or sense making prior to sending the sensor data.","specifier":"The means of augmentation and the source of additional data are indicated by a specifier.","occurs":"Sensor-Related Actions"},{"name":"INVESTIGATE","description":"The INVESTIGATE action tasks the recipient enclave to aggregate and report information as it pertains to an anomaly.","specifier":"Examples of actions resulting from a received INVESTIGATE OpenC2 command could include scan multiple machines, quarantine an endpoint, or detonate a file. These actions are determined by the enclave based on the results of sense-making/analytics and decision-making based on operational constraints and mission needs.","occurs":"Effects-Based Actions"},{"name":"MITIGATE","description":"The MITIGATE action tasks the recipient enclave to circumvent the problem without necessarily eliminating the vulnerability or attack point.  \nMitigate implies that the impacts to the enclave’s operations should be minimized while addressing the issue.","specifier":"Examples of actions resulting from a received MITIGATE OpenC2 command could include deny a URL or process, scan, redirect traffic to honeypot, or move.","occurs":"Effects-Based Actions"},{"name":"REMEDIATE","description":"The REMEDIATE action tasks the recipient enclave to eliminate the vulnerability or attack point.  \nRemediate implies that addressing the issue is paramount.","specifier":"Examples of actions resulting from a received REMEDIATE OpenC2 command could include contain/quarantine to a VLAN, set authorizations, redirect URL to quarantine portal, get new configuration, or update patches.","occurs":"Effects-Based Actions"},{"name":"RESPONSE","description":null,"specifier":null,"occurs":"Response"},{"name":"ACKNOWLEDGEMENT","description":null,"specifier":null,"occurs":null},{"name":"REMOVE","description":"REPLACED WITH DELETE","specifier":null,"occurs":null},{"name":"???","description":null,"specifier":null,"occurs":null}],"target":[{"name":"cybox:Account","description":"The Account object is intended to characterize generic accounts.","specifier":null,"occurs":null},{"name":"cybox:Address","description":"The Address object is intended to specify a cyber address.","specifier":"cybox:AddressObjectType:\nAddress Value, VLAN Name, VLAN Num","occurs":1},{"name":"cybox:API","description":null,"specifier":null,"occurs":null},{"name":"cybox:Archive_File","description":null,"specifier":null,"occurs":null},{"name":"cybox:ARP_Cache","description":null,"specifier":null,"occurs":null},{"name":"cybox:Artifact","description":null,"specifier":null,"occurs":null},{"name":"cybox:AS","description":"The AS element is intended to characterize a single autonomous system (AS).","specifier":null,"occurs":null},{"name":"cybox:Code","description":"The Code object is intended to characterize a body of computer code.","specifier":null,"occurs":null},{"name":"cybox:Custom","description":"The Custom object is intended to characterize objects that are not described by other defined CybOX Object schemas. Objects of this type have no pre-defined properties but instead all properties are provided by the author..","specifier":null,"occurs":null},{"name":"cybox:Device","description":"The Device object is intended to characterize a specific Device.","specifier":"cybox:DeviceObjectType:\nDescription, Device Type, Manufacturer, Model, Serial Number, Firmware Version, System Details","occurs":1},{"name":"cybox:Disk","description":"The Disk object is intended to characterize a disk drive.","specifier":"cybox:DiskObjectType:\nDisk Name, Disk Size, Free Space, Partition List, Type","occurs":1},{"name":"cybox:Disk_Partition","description":"The Disk_Partition object is intended to characterize a single partition of a disk drive.","specifier":"cybox:DiskPartitionObjectType:\nCreated, Device Name, Mount Point, Partition ID, Partition Length, Partition Offset, Space Left, Space Used, Total Space, Type","occurs":1},{"name":"cybox:DNS_Cache","description":null,"specifier":null,"occurs":null},{"name":"cybox:DNS_Query","description":null,"specifier":null,"occurs":null},{"name":"cybox:DNS_Record","description":null,"specifier":null,"occurs":null},{"name":"cybox:Domain_Name","description":"The Domain_Name object is intended to characterize network domain names.","specifier":"cybox:DomainNameObjectType:\nValue","occurs":1},{"name":"cybox:Email_Message","description":"The Email_Message object is intended to characterize an individual email message.","specifier":"cybox:EmailMessageObjectType:\nHeader, Email Server, Raw Body, Raw Header, Attachments, Links","occurs":1},{"name":"cybox:File","description":"The File object is intended to characterize a generic file.","specifier":"cybox:FileObjectType:\nFile Name, File Path, Device Path, Full Path, File Extension, Size In Bytes, Magic Number, File Format, Hashes, Digital Signatures, Modified Time, Accessed Time, Created Time, File Attributes List, Permissions, User Owner, Packer List, Peak Entropy, Sym Links, Byte Runs, Extracted Features, Encryption Algorithm, Decryption Key, Compression Method, Compression Version, Compression Comment","occurs":1},{"name":"cybox:GUI_Dialogbox","description":null,"specifier":null,"occurs":null},{"name":"cybox:GUI","description":null,"specifier":null,"occurs":null},{"name":"cybox:GUI_Window","description":null,"specifier":null,"occurs":null},{"name":"cybox:Hostname","description":"The Hostname object is intended to specify a particular network hostname.","specifier":"cybox:HostNameObjectType:\nHostname Value, Naming System","occurs":1},{"name":"cybox:HTTP_Session","description":null,"specifier":null,"occurs":null},{"name":"cybox:Image_File","description":"The Image_File object is intended to characterize image files.","specifier":"cybox:ImageFileObjectType:\nImage File Format, Image Height, Image Width, Bits Per Pixel, Compression Algorithm","occurs":null},{"name":"cybox:Library","description":null,"specifier":null,"occurs":null},{"name":"cybox:Link","description":null,"specifier":null,"occurs":null},{"name":"cybox:Linux_Package","description":null,"specifier":null,"occurs":null},{"name":"cybox:Memory","description":"The Memory_Region object is intended to characterize generic memory objects.","specifier":"cybox:MemoryObjectType:\nHashes, Name, Memory Source, Region Size, Block Type, Region Start Address, Region End Address, Extracted Features","occurs":1},{"name":"cybox:Mutex","description":"The Mutex object is intended to characterize generic mutual exclusion (mutex) objects.","specifier":null,"occurs":null},{"name":"cybox:Network_Connection","description":"The Network_Connection object is intended to represent a single network connection.","specifier":"cybox:NetworkConnectionObjectType:\nLayer3 Protocol, Layer4 Protocol, Source Socket Address (IP Address/Port), Destination Socket Address, (IP Address/Port)","occurs":1},{"name":"cybox:Network_Flow","description":"The Network_Flow_Object object provides a summary of network traffic, expressed as flows of multiple packets instead of individual packets, without the packet payload data (i.e. the actual data that was uploaded/downloaded to and from the Dest IP to Source IP as included in packet monitoring tools, such as Wireshark).","specifier":"cybox:NetworkFlowObjectType:\nNetwork Flow Label (Src Socket Address, Dest Socket Address, IP Protocol), Unidirectional Flow Record, Bidrectional Flow Record","occurs":1},{"name":"cybox:Network_Packet","description":"The Network_Packet object provides the definition of a network packet based on the TCP/IP model/Internet protocol suite. In the TCP/IP stack, \"packet\" is generally defined as IP header plus payload, but we also include the LinkLayer from the OSI model, which defines the physical network interfaces and routing protocols. The application layer has not yet been defined.","specifier":"cybox:NetworkPacket:\nLink Layer, Internet Layer, Transport Layer","occurs":1},{"name":"cybox:Network_Route_Entry","description":null,"specifier":null,"occurs":null},{"name":"cybox:Network_Route","description":null,"specifier":null,"occurs":null},{"name":"cybox:Network_Socket","description":null,"specifier":null,"occurs":null},{"name":"cybox:Network_Subnet","description":"The Network_Subnet object is intended to characterize a generic system network subnet.","specifier":"cybox:NetworkSubnetObjectType:\nName, Description, Number Of IP Addresses, Routes","occurs":1},{"name":"cybox:PDF_File","description":null,"specifier":null,"occurs":null},{"name":"cybox:Pipe","description":null,"specifier":null,"occurs":null},{"name":"cybox:Port","description":"The Port object is intended to characterize networking ports.","specifier":"cybox:PortObjectType:\nPort Value, Layer4 Protocol","occurs":1},{"name":"cybox:Process","description":"The Process object is intended to characterize system processes.","specifier":"cybox:ProcessObjectType:\nPID, Name, Creation Time, Parent PID, Child PID List, Image Info, Argument List, Environment Variable List, Kernel Time, Post List, Network Connection List, Start Time, Status, Username, User Time, Extracted Features","occurs":1},{"name":"cybox:Product","description":"The Product object is intended to characterize software or hardware products.","specifier":"cybox:ProductObjectType:\nEdition, Language, Product, Update, Vendor, Version, Device Details","occurs":1},{"name":"cybox:Semaphore","description":null,"specifier":null,"occurs":null},{"name":"cybox:SMS_Message","description":null,"specifier":null,"occurs":null},{"name":"cybox:Socket_Address","description":null,"specifier":null,"occurs":null},{"name":"cybox:System","description":"The System object is intended to characterize computer systems (as a combination of both software and hardware).","specifier":"cybox:SystemObjectType:\nAvailable Physical Memory, BIOS Info, Date, Hostname, Local Time, Network Interface List, OS, Processor, Processor Architecture, System Time, Timezone DST, Timezone Standard, Total Physical Memory, Uptime, Username","occurs":1},{"name":"cybox:Unix_File","description":null,"specifier":null,"occurs":null},{"name":"cybox:Unix_Network_Route_Entry","description":null,"specifier":null,"occurs":null},{"name":"cybox:Unix_Pipe","description":null,"specifier":null,"occurs":null},{"name":"cybox:Unix_Process","description":null,"specifier":null,"occurs":null},{"name":"cybox:Unix_User_Account","description":null,"specifier":null,"occurs":null},{"name":"cybox:Unix_Volume","description":null,"specifier":null,"occurs":null},{"name":"cybox:URI","description":"The URI object is intended to characterize Uniform Resource Identifiers (URI’s).","specifier":"cybox:URIObjectType\nValue","occurs":1},{"name":"cybox:URL_History","description":null,"specifier":null,"occurs":null},{"name":"cybox:User_Account","description":"The User_Account object is intended to characterize generic user accounts.","specifier":"cybox:UserAccountObjectType:\nFull Name, Group List, Home Directory, Last Login, Privilege List, Script Path, Username, User Password Age","occurs":1},{"name":"cybox:User_Session","description":"The User_Session object is intended to characterize user sessions.","specifier":"cybox:UserSessionObjectType:\nEffective Group, Effective Group ID, Effective User, Effective User ID, Login Time, Logout Time","occurs":1},{"name":"cybox:Volume","description":"The Volume object is intended to characterize generic drive volumes.","specifier":"cybox:VolumeObjectType:\nName, Device Path, File System Type, Total Allocation Units, Sectors Per Allocation Unit, Bytes Per Sector, Actual Available Allocation Units, Creation Time, File System Flag List, Serial Number","occurs":1},{"name":"cybox:Whois","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Computer_Account","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Critical_Section","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Driver","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Event","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Executable_File","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_File","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Filemapping","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Handle","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Hook","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Kernel_Hook","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Kernel","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Mailslot","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Memory_Page_Region","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Mutex","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Network_Route_Entry","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Network_Share","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Pipe","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Prefetch","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Process","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Registry_Key","description":"Windows_Registry_Key object characterizes windows registry objects, including Keys and Key/Value pairs. See also: http://msdn.microsoft.com/en-us/library/windows/desktop/ms724871(v=vs.85).aspx.","specifier":"cybox:WindowsRegistryKeyObjectType:\nKey, Hive, Number Values, Values, Modified Time, Creator Username, Handle List, Number Subkeys, Subkeys, Byte Runs","occurs":1},{"name":"cybox:Windows_Semaphore","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Service","description":"Windows_Service object is intended to characterize Windows services. See also: http://msdn.microsoft.com/en-us/library/windows/desktop/ms685141(v=vs.85).aspx.","specifier":"cybox:WindowsServiceObjectType:\nDescription List, Display Name, Group Name, Service Name, Service DLL, Service DLL Certificate Issuer, Service DLL Certificate Subject, Service DLL Hashes, Service DLL Signature Description, Startup Command Line, Startup Type, Service Status, Service Type, Started As","occurs":1},{"name":"cybox:Windows_System","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_System_Restore","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Task","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Thread","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_User_Account","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Volume","description":null,"specifier":null,"occurs":null},{"name":"cybox:Windows_Waitable_Timer","description":null,"specifier":null,"occurs":null},{"name":"cybox:X509_Certificate","description":"X509_Certificate object represents a public key certificate for use in a public key infrastructure.","specifier":"cybox:X509CertificateObjectType:\nCertificate, Raw Certificate, Certificate Signature","occurs":1},{"name":"data","description":null,"specifier":null,"occurs":null},{"name":"data.configuration","description":null,"specifier":null,"occurs":null},{"name":"data.indicator","description":null,"specifier":null,"occurs":null},{"name":"data.permission","description":null,"specifier":null,"occurs":null},{"name":"data.results","description":null,"specifier":null,"occurs":null},{"name":"data.signature","description":null,"specifier":null,"occurs":null},{"name":"data.software","description":null,"specifier":null,"occurs":null},{"name":"data.status","description":null,"specifier":null,"occurs":null},{"name":"data.user","description":null,"specifier":null,"occurs":null},{"name":"endpoint.hips","description":null,"specifier":null,"occurs":null},{"name":"network","description":null,"specifier":null,"occurs":null},{"name":"network.external","description":null,"specifier":null,"occurs":null},{"name":"network.sensor","description":null,"specifier":null,"occurs":null},{"name":"network.traffic","description":null,"specifier":null,"occurs":null},{"name":"system.shell","description":null,"specifier":null,"occurs":null},{"name":"system.vm","description":null,"specifier":null,"occurs":null},{"name":"user.admin","description":null,"specifier":null,"occurs":null},{"name":"user.group","description":null,"specifier":null,"occurs":null},{"name":"???","description":null,"specifier":null,"occurs":null},{"name":"  ","description":null,"specifier":null,"occurs":null}],"actuator":[{"name":"endpoint","description":"Endpoint Device","specifier":null,"occurs":1},{"name":"endpoint.workstation","description":null,"specifier":null,"occurs":1},{"name":"endpoint.server","description":null,"specifier":null,"occurs":1},{"name":"endpoint.laptop","description":null,"specifier":null,"occurs":1},{"name":"endpoint.smart-phone","description":null,"specifier":null,"occurs":1},{"name":"endpoint.tablet","description":null,"specifier":null,"occurs":1},{"name":"endpoint.printer","description":null,"specifier":null,"occurs":1},{"name":"endpoint.smart-meter","description":null,"specifier":null,"occurs":1},{"name":"endpoint.pos-terminal","description":null,"specifier":null,"occurs":1},{"name":"endpoint.digital-telephone-handset","description":null,"specifier":null,"occurs":1},{"name":"endpoint.sensor","description":null,"specifier":null,"occurs":1},{"name":"network","description":"Network Platform","specifier":null,"occurs":1},{"name":"network.firewall","description":null,"specifier":null,"occurs":1},{"name":"network.router","description":null,"specifier":null,"occurs":1},{"name":"network.ids","description":null,"specifier":null,"occurs":1},{"name":"network.hub","description":null,"specifier":null,"occurs":1},{"name":"network.bridge","description":null,"specifier":null,"occurs":1},{"name":"network.switch","description":null,"specifier":null,"occurs":1},{"name":"network.modem","description":null,"specifier":null,"occurs":1},{"name":"network.wap","description":"Wireless Access Point","specifier":null,"occurs":1},{"name":"network.gateway","description":null,"specifier":null,"occurs":1},{"name":"network.proxy","description":null,"specifier":null,"occurs":1},{"name":"network.nic","description":"Network Interface Card","specifier":null,"occurs":1},{"name":"network.vpn","description":"VPN Concentrator/Appliance","specifier":null,"occurs":1},{"name":"network.guard","description":null,"specifier":null,"occurs":1},{"name":"network.sensor","description":null,"specifier":null,"occurs":1},{"name":"network.hips","description":null,"specifier":null,"occurs":1},{"name":"network.ips","description":null,"specifier":null,"occurs":1},{"name":"network.security_manager","description":null,"specifier":null,"occurs":1},{"name":"network.sense_making","description":null,"specifier":null,"occurs":1},{"name":"process","description":"Services/Processes","specifier":null,"occurs":1},{"name":"process.vulnerability-scanner","description":null,"specifier":null,"occurs":1},{"name":"process.network-scanner","description":null,"specifier":null,"occurs":1},{"name":"process.connection-scanner","description":null,"specifier":null,"occurs":1},{"name":"process.anti-virus-scanner","description":null,"specifier":null,"occurs":1},{"name":"process.file-scanner","description":null,"specifier":null,"occurs":1},{"name":"process.aaa-server","description":null,"specifier":null,"occurs":1},{"name":"process.virtualization-service","description":null,"specifier":null,"occurs":1},{"name":"process.sandbox","description":null,"specifier":null,"occurs":1},{"name":"process.dns-server","description":null,"specifier":null,"occurs":1},{"name":"process.email-service","description":null,"specifier":null,"occurs":1},{"name":"process.directory-service","description":null,"specifier":null,"occurs":1},{"name":"process.remediation-service","description":null,"specifier":null,"occurs":1},{"name":"process.reputation-service","description":null,"specifier":null,"occurs":1},{"name":"process.virtualization-service","description":null,"specifier":null,"occurs":1},{"name":"process.location-service","description":null,"specifier":null,"occurs":1},{"name":"???","description":null,"specifier":null,"occurs":null},{"name":"  ","description":null,"specifier":null,"occurs":null}]}}